import '../scss/Profile.scss'
import { BaseLayout } from "./BaseLayout"
import { ButtonComponent } from '../components/ButtonComponent/ButtonComponent'
import { ProductList } from '../components/ProductsList/ProductsList'
import { SwitcherComponent } from '../components/SwitcherComponent/SwitcherComponent'
import { Link } from 'react-router-dom'

export const Profile = () => {

    return (
        <BaseLayout>
            <div className='container'>
                <div className='profile-header'>
                    <svg width="77" height="77" viewBox="0 0 52 52" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path fill-rule="evenodd" clip-rule="evenodd" d="M26 5.2C22.362 5.19933 18.7874 6.15287 15.6331 7.96543C12.4787 9.778 9.85497 12.3862 8.02366 15.5297C6.19235 18.6732 5.21755 22.242 5.19656 25.88C5.17556 29.5179 6.10911 33.0978 7.90402 36.2622C9.11721 34.6855 10.6767 33.4089 12.462 32.5311C14.2473 31.6534 16.2106 31.1979 18.2 31.2H33.8C35.7894 31.1979 37.7527 31.6534 39.538 32.5311C41.3233 33.4089 42.8828 34.6855 44.096 36.2622C45.8909 33.0978 46.8244 29.5179 46.8034 25.88C46.7825 22.242 45.8077 18.6732 43.9763 15.5297C42.145 12.3862 39.5213 9.778 36.3669 7.96543C33.2126 6.15287 29.638 5.19933 26 5.2ZM46.6518 41.7976C46.9776 41.3729 47.2896 40.9379 47.5878 40.4924C50.4702 36.2094 52.0067 31.1626 52 26C52 11.6402 40.3598 0 26 0C11.6402 0 2.66642e-05 11.6402 2.66642e-05 26C-0.00816677 31.7116 1.87213 37.2656 5.34822 41.7976L5.33522 41.8444L6.25822 42.9182C8.69672 45.7691 11.7244 48.0574 15.1326 49.6253C18.5408 51.1931 22.2485 52.0033 26 52C26.5616 52 27.1197 51.9827 27.6744 51.948C32.3658 51.6522 36.888 50.0836 40.755 47.411C42.6044 46.1352 44.2806 44.625 45.7418 42.9182L46.6648 41.8444L46.6518 41.7976ZM26 10.4C23.9313 10.4 21.9474 11.2218 20.4846 12.6846C19.0218 14.1473 18.2 16.1313 18.2 18.2C18.2 20.2687 19.0218 22.2526 20.4846 23.7154C21.9474 25.1782 23.9313 26 26 26C28.0687 26 30.0526 25.1782 31.5154 23.7154C32.9782 22.2526 33.8 20.2687 33.8 18.2C33.8 16.1313 32.9782 14.1473 31.5154 12.6846C30.0526 11.2218 28.0687 10.4 26 10.4Z" fill="black" />
                    </svg>
                    <div className='profile-header__self'>
                        <h3>ФИО</h3>
                        <span>Статус профиля</span>
                    </div>
                    <ButtonComponent className='profile-header__edit-btn'>Редактировать профиль</ButtonComponent>
                </div>
                <div className='profile-products'>
                    <div className='profile-products__header'>
                        <h2>Мои товары</h2>
                        <ButtonComponent>
                            <Link to='/profile/create-product'>
                                <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M27.8571 17.1429H17.1429V27.8571C17.1429 28.4255 16.9171 28.9705 16.5152 29.3724C16.1134 29.7742 15.5683 30 15 30C14.4317 30 13.8866 29.7742 13.4848 29.3724C13.0829 28.9705 12.8571 28.4255 12.8571 27.8571V17.1429H2.14286C1.57454 17.1429 1.02949 16.9171 0.627629 16.5152C0.225765 16.1134 0 15.5683 0 15C0 14.4317 0.225765 13.8866 0.627629 13.4848C1.02949 13.0829 1.57454 12.8571 2.14286 12.8571H12.8571V2.14286C12.8571 1.57454 13.0829 1.02949 13.4848 0.627628C13.8866 0.225764 14.4317 0 15 0C15.5683 0 16.1134 0.225764 16.5152 0.627628C16.9171 1.02949 17.1429 1.57454 17.1429 2.14286V12.8571H27.8571C28.4255 12.8571 28.9705 13.0829 29.3724 13.4848C29.7742 13.8866 30 14.4317 30 15C30 15.5683 29.7742 16.1134 29.3724 16.5152C28.9705 16.9171 28.4255 17.1429 27.8571 17.1429Z" fill="black" />
                                </svg>
                            </Link>
                        </ButtonComponent>
                        <SwitcherComponent states={['в наличии', 'в аренде']}></SwitcherComponent>
                    </div>
                    <ProductList products={[]}></ProductList>
                </div>
            </div>
        </BaseLayout>
    )
}